# Scoop packages for Windows
# Usage: Get-Content scoop.txt | ForEach-Object { scoop install $_ }
# First run: scoop bucket add extras; scoop bucket add nerd-fonts

# Core tools
git
git-lfs
delta
gh
curl
wget

# Shell and terminal
starship
fzf
ripgrep
fd
zoxide
jq
yq
sd
bat
eza
tldr
xh

# System monitoring and utilities
procs
bottom
dust
duf
hyperfine
tokei

# Development tools
neovim
python
nodejs
go
rust
mise

# Note: tree-sitter CLI installed via npm (see install.ps1)

# Terminal multiplexer and tools
tmux
lazygit
direnv
just
atuin

# Fonts
JetBrainsMono-NF
FiraCode-NF

# Utilities
7zip
sudo
which
grep
sed
make
gcc